benchmark_results_docker/fileio_bench_rndrd_18G_docker.txt
sysbench 1.0.18 (using system LuaJIT 2.0.5)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 144MiB each
18GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random read test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      9211.55
    writes/s:                     0.00
    fsyncs/s:                     0.00

Throughput:
    read, MiB/s:                  143.93
    written, MiB/s:               0.00

General statistics:
    total time:                          120.0011s
    total number of events:              1105445

Latency (ms):
         min:                                    0.00
         avg:                                    0.11
         max:                                    7.28
         95th percentile:                        0.26
         sum:                               118878.45

Threads fairness:
    events (avg/stddev):           1105445.0000/0.00
    execution time (avg/stddev):   118.8785/0.00