benchmark_results_docker/fileio_bench_rndwr_18G_docker.txt
sysbench 1.0.18 (using system LuaJIT 2.0.5)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 144MiB each
18GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     599.40
    fsyncs/s:                     767.59

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               9.37

General statistics:
    total time:                          120.1136s
    total number of events:              164074

Latency (ms):
         min:                                    0.00
         avg:                                    0.73
         max:                                   27.54
         95th percentile:                        2.48
         sum:                               119790.62

Threads fairness:
    events (avg/stddev):           164074.0000/0.00
    execution time (avg/stddev):   119.7906/0.00