benchmark_results_docker/fileio_bench_rndwr_docker.txt
sysbench 1.0.18 (using system LuaJIT 2.0.5)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 56MiB each
7GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     548.42
    fsyncs/s:                     702.08

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               8.57

General statistics:
    total time:                          300.1304s
    total number of events:              375190

Latency (ms):
         min:                                    0.00
         avg:                                    0.80
         max:                                   25.95
         95th percentile:                        2.52
         sum:                               299516.20

Threads fairness:
    events (avg/stddev):           375190.0000/0.00
    execution time (avg/stddev):   299.5162/0.00